## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| add      | `aws_docdb_cluster_instance.ai-answers-docdb-instance[1]` |
| update   | `aws_security_group.ai-answers-docdb-sg`                  |
| recreate | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] must be replaced
-/+ resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      ~ arn                             = "arn:aws:rds:ca-central-1:730335533085:db:ai-answers-docdb-instance" -> (known after apply)
      ~ availability_zone               = "ca-central-1b" -> (known after apply)
      ~ ca_cert_identifier              = "rds-ca-rsa2048-g1" -> (known after apply)
      - copy_tags_to_snapshot           = false -> null
      ~ db_subnet_group_name            = "ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ dbi_resource_id                 = "db-EPM2OP45Q75SETIITLSS4NP2QY" -> (known after apply)
      ~ endpoint                        = "ai-answers-docdb-instance.czuu8ii2ypob.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.0.0" -> (known after apply)
      ~ id                              = "ai-answers-docdb-instance" -> (known after apply)
      ~ identifier                      = "ai-answers-docdb-instance" -> "ai-answers-docdb-instance-0" # forces replacement
      + identifier_prefix               = (known after apply)
      ~ instance_class                  = "db.t3.medium" -> "db.r5.large"
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:730335533085:key/e393e2aa-0ea4-4abb-aa52-6f54ce42e195" -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 27017 -> (known after apply)
      ~ preferred_backup_window         = "03:55-04:25" -> (known after apply)
      ~ preferred_maintenance_window    = "tue:06:56-tue:07:26" -> (known after apply)
      ~ publicly_accessible             = false -> (known after apply)
      ~ storage_encrypted               = true -> (known after apply)
      ~ tags                            = {
            "CostCentre" = "ai-answers-prod"
          + "Temporary"  = "true"
            "Terraform"  = "true"
        }
      ~ tags_all                        = {
          + "Temporary"  = "true"
            # (2 unchanged elements hidden)
        }
      ~ writer                          = true -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[1] will be created
  + resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = "ai-answers-docdb-cluster"
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "ai-answers-docdb-instance-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.large"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "CostCentre" = "ai-answers-prod"
          + "Temporary"  = "true"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "ai-answers-prod"
          + "Temporary"  = "true"
          + "Terraform"  = "true"
        }
      + writer                          = (known after apply)
    }

  # aws_security_group.ai-answers-docdb-sg will be updated in-place
  ~ resource "aws_security_group" "ai-answers-docdb-sg" {
        id                     = "sg-0460d56ca21d60174"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07118a56173a9543b",
                ]
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "ai-answers-example-docdb-sg"
        tags                   = {
            "CostCentre" = "ai-answers-prod"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
